# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetProperty..::..Dispose Method
AssetProperty Class See Also
---
Releases all resources used by the AssetProperty
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace